cmsis-svd/cmsis-svd/data/Infineon/s6e1b3xf.svd
        <!-- REGISTER "ADCMP_ACFS54" -->
        <register>
          <name>ADCMP_ACFS54</name>
          <description>ADCMP ch.4/5 Connecting FRT Select Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x172</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSA5" -->
            <field>
              <name>FSA5</name>
              <description>Specify the FRT to be connected to ADCMP ch.(5)</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSA4" -->
            <field>
              <name>FSA4</name>
              <description>Specify the FRT to be connected to ADCMP ch.(4)</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACMP0" -->
        <register>
          <name>ADCMP_ACMP0</name>
          <description>ADCMP ch.0 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1BA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ACMP" -->
            <field>
              <name>ACMP</name>
              <description>Specifies an AD conversion start time</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACMP1" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP1</name>
          <description>ADCMP ch.1 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1BE</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP2" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP2</name>
          <description>ADCMP ch.2 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1C2</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP3" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP3</name>
          <description>ADCMP ch.3 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1C6</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP4" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP4</name>
          <description>ADCMP ch.4 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1CA</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP5" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP5</name>
          <description>ADCMP ch.5 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1CE</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSA" -->
        <register>
          <name>ADCMP_ACSA</name>
          <description>ADCMP Control Register A</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL54" -->
            <field>
              <name>SEL54</name>
              <description>Selects compatible operation of ADCMP ch.5 and ch.4 with FM3 Family products</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL32" -->
            <field>
              <name>SEL32</name>
              <description>Selects compatible operation of ADCMP ch.3 and ch.2 with FM3 Family products</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL10" -->
            <field>
              <name>SEL10</name>
              <description>Selects compatible operation of ADCMP ch.1 and ch.0 with FM3 Family products</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE54" -->
            <field>
              <name>CE54</name>
              <description>Enables/disables compatibility of ADCMP ch.5 and ch.4 with FM3 Family products</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE32" -->
            <field>
              <name>CE32</name>
              <description>Enables/disables compatibility of ADCMP ch.3 and ch.2 with FM3 Family products</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE10" -->
            <field>
              <name>CE10</name>
              <description>Enables/disables compatibility of ADCMP ch.1 and ch.0 with FM3 Family products</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
