cmsis-svd/cmsis-svd/data/Infineon/s6e1b3xf.svd
        <!-- REGISTER "GATEC8" -->
        <register>
          <name>GATEC8</name>
          <description>PPG Gate Function Control Register 8</description>
          <addressOffset>0x298</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG10" -->
            <field>
              <name>STRG10</name>
              <description>Select trigger bit for PPG10</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE10" -->
            <field>
              <name>EDGE10</name>
              <description>Start Effective Level Select bit for PPG10</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG8" -->
            <field>
              <name>STRG8</name>
              <description>Select trigger bit for PPG8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE8" -->
            <field>
              <name>EDGE8</name>
              <description>Start Effective Level Select bit for PPG8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC12" -->
        <register>
          <name>GATEC12</name>
          <description>PPG Gate Function Control Register 12</description>
          <addressOffset>0x2D8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG14" -->
            <field>
              <name>STRG14</name>
              <description>Select trigger bit for PPG14</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE14" -->
            <field>
              <name>EDGE14</name>
              <description>Start Effective Level Select bit for PPG14</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG12" -->
            <field>
              <name>STRG12</name>
              <description>Select trigger bit for PPG12</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE12" -->
            <field>
              <name>EDGE12</name>
              <description>Start Effective Level Select bit for PPG12</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC16" -->
        <register>
          <name>GATEC16</name>
          <description>PPG Gate Function Control Register 16</description>
          <addressOffset>0x318</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG18" -->
            <field>
              <name>STRG18</name>
              <description>Select trigger bit for PPG18</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE18" -->
            <field>
              <name>EDGE18</name>
              <description>Start Effective Level Select bit for PPG18</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG16" -->
            <field>
              <name>STRG16</name>
              <description>Select trigger bit for PPG16</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE16" -->
            <field>
              <name>EDGE16</name>
              <description>Start Effective Level Select bit for PPG16</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC20" -->
        <register>
          <name>GATEC20</name>
          <description>PPG Gate Function Control Register 20</description>
          <addressOffset>0x358</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG22" -->
            <field>
              <name>STRG22</name>
              <description>Select trigger bit for PPG22</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE22" -->
            <field>
              <name>EDGE22</name>
              <description>Start Effective Level Select bit for PPG22</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG20" -->
            <field>
              <name>STRG20</name>
              <description>Select trigger bit for PPG20</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE20" -->
            <field>
              <name>EDGE20</name>
              <description>Start Effective Level Select bit for PPG20</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IGBTC" -->
        <register>
          <name>IGBTC</name>
          <description>IGBT Mode Control Register</description>
          <addressOffset>0x380</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IGATIH" -->
            <field>
              <name>IGATIH</name>
              <description>Stop prohibition mode selection in output active bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGNFW" -->
            <field>
              <name>IGNFW</name>
              <description>Noise filter width selection bit</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGOSEL" -->
            <field>
              <name>IGOSEL</name>
              <description>Output level selection bit</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGTRGLV" -->
            <field>
              <name>IGTRGLV</name>
              <description>Trigger input level selection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IGBTMD" -->
            <field>
              <name>IGBTMD</name>
              <description>IGBT mode selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
