cmsis-svd/cmsis-svd/data/Infineon/s6e1b3xf.svd
        <!-- REGISTER "EPFR08" -->
        <register>
          <name>EPFR08</name>
          <description>Extended Pin Function Setting Register 08</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK7B" -->
            <field>
              <name>SCK7B</name>
              <description>SCK7 Input/Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT7B" -->
            <field>
              <name>SOT7B</name>
              <description>SOT7 Input/Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN7S" -->
            <field>
              <name>SIN7S</name>
              <description>SIN7 Input Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK6B" -->
            <field>
              <name>SCK6B</name>
              <description>SCK6 Input/Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT6B" -->
            <field>
              <name>SOT6B</name>
              <description>SOT6 Input/Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN6S" -->
            <field>
              <name>SIN6S</name>
              <description>SIN6 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK5B" -->
            <field>
              <name>SCK5B</name>
              <description>SCK5 Input/Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT5B" -->
            <field>
              <name>SOT5B</name>
              <description>SOT5 Input/Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN5S" -->
            <field>
              <name>SIN5S</name>
              <description>SIN5 Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK4B" -->
            <field>
              <name>SCK4B</name>
              <description>SCK4 Input/Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT4B" -->
            <field>
              <name>SOT4B</name>
              <description>SOT4 Input/Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN4S" -->
            <field>
              <name>SIN4S</name>
              <description>SIN4 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTS4S" -->
            <field>
              <name>CTS4S</name>
              <description>CTS4 Input Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTS4E" -->
            <field>
              <name>RTS4E</name>
              <description>RTS4 Output Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR09" -->
        <register>
          <name>EPFR09</name>
          <description>Extended Pin Function Setting Register 09</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CTX1E" -->
            <field>
              <name>CTX1E</name>
              <description>CTX1E Output Select bits</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRX1S" -->
            <field>
              <name>CRX1S</name>
              <description>CRX1S Input Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTX0E" -->
            <field>
              <name>CTX0E</name>
              <description>CTX0E Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRX0S" -->
            <field>
              <name>CRX0S</name>
              <description>CRX0S Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADTRG2S" -->
            <field>
              <name>ADTRG2S</name>
              <description>ADTRG2 Input Select bits</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADTRG1S" -->
            <field>
              <name>ADTRG1S</name>
              <description>ADTRG1 Input Select bits</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADTRG0S" -->
            <field>
              <name>ADTRG0S</name>
              <description>ADTRG0 Input Select bits</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QZIN1S" -->
            <field>
              <name>QZIN1S</name>
              <description>QZIN1S Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QBIN1S" -->
            <field>
              <name>QBIN1S</name>
              <description>QBIN1S Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QAIN1S" -->
            <field>
              <name>QAIN1S</name>
              <description>QAIN1S Input Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QZIN0S" -->
            <field>
              <name>QZIN0S</name>
              <description>QZIN0S Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QBIN0S" -->
            <field>
              <name>QBIN0S</name>
              <description>QBIN0S Input Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QAIN0S" -->
            <field>
              <name>QAIN0S</name>
              <description>QAIN0S Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR15" -->
        <register>
          <name>EPFR15</name>
          <description>Extended Pin Function Setting Register 15</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT31S" -->
            <field>
              <name>EINT31S</name>
              <description>External Interrupt 31 Input Select bits</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT30S" -->
            <field>
              <name>EINT30S</name>
              <description>External Interrupt 30 Input Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT29S" -->
            <field>
              <name>EINT29S</name>
              <description>External Interrupt 29 Input Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT28S" -->
            <field>
              <name>EINT28S</name>
              <description>External Interrupt 28 Input Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT27S" -->
            <field>
              <name>EINT27S</name>
              <description>External Interrupt 27 Input Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT26S" -->
            <field>
              <name>EINT26S</name>
              <description>External Interrupt 26 Input Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT25S" -->
            <field>
              <name>EINT25S</name>
              <description>External Interrupt 25 Input Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT24S" -->
            <field>
              <name>EINT24S</name>
              <description>External Interrupt 24 Input Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT23S" -->
            <field>
              <name>EINT23S</name>
              <description>External Interrupt 23 Input Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT22S" -->
            <field>
              <name>EINT22S</name>
              <description>External Interrupt 22 Input Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT21S" -->
            <field>
              <name>EINT21S</name>
              <description>External Interrupt 21 Input Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT20S" -->
            <field>
              <name>EINT20S</name>
              <description>External Interrupt 20 Input Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT19S" -->
            <field>
              <name>EINT19S</name>
              <description>External Interrupt 19 Input Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT18S" -->
            <field>
              <name>EINT18S</name>
              <description>External Interrupt 18 Input Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT17S" -->
            <field>
              <name>EINT17S</name>
              <description>External Interrupt 17 Input Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT16S" -->
            <field>
              <name>EINT16S</name>
              <description>External Interrupt 16 Input Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
