cmsis-svd/cmsis-svd/data/Infineon/s6e1b3xf.svd
        <!-- REGISTER "LVD_RLR" -->
        <register>
          <name>LVD_RLR</name>
          <description>Low-voltage Detection Voltage Protection Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDLCK" -->
            <field>
              <name>LVDLCK</name>
              <description>Low-voltage Detection Voltage Control Register protection bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_STR2" -->
        <register>
          <name>LVD_STR2</name>
          <description>Low-voltage Detection Circuit Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0040</resetValue>
          <resetMask>0x80C0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVD2IRDY" -->
            <field>
              <name>LVD2IRDY</name>
              <description>Low-voltage detection 2 interrupt status flag</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LVDIRDY" -->
            <field>
              <name>LVDIRDY</name>
              <description>Low-voltage detection interrupt status flag</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LVDRRDY" -->
            <field>
              <name>LVDRRDY</name>
              <description>Low-voltage detection reset status flag</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_CTL2" -->
        <register>
          <name>LVD_CTL2</name>
          <description>Low-voltage Detection Release Voltage Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x000C</resetValue>
          <resetMask>0x01FC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDPOL" -->
            <field>
              <name>LVDPOL</name>
              <description>Low-voltage detection polarity setting bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LVDRLIE" -->
            <field>
              <name>LVDRLIE</name>
              <description>Low-voltage detection release voltage setting enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVHRLI" -->
            <field>
              <name>SVHRLI</name>
              <description>Low-voltage detection release voltage setting bits</description>
              <msb>6</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD2_CTL" -->
        <register>
          <name>LVD2_CTL</name>
          <description>Low-Voltage Detection Channel 2 Voltage Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x000C</resetValue>
          <resetMask>0x00FC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVD2IE" -->
            <field>
              <name>LVD2IE</name>
              <description>Low-voltage detection 2 interrupt enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVH2I" -->
            <field>
              <name>SVH2I</name>
              <description>Low-voltage detection 2 interrupt voltage setting bits</description>
              <msb>6</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD2_CTL2" -->
        <register>
          <name>LVD2_CTL2</name>
          <description>Low-Voltage Detection Channel 2 Release Voltage Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x000C</resetValue>
          <resetMask>0x01FC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVD2POL" -->
            <field>
              <name>LVD2POL</name>
              <description>Low-voltage detection 2 polarity setting bits</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LVD2RLIE" -->
            <field>
              <name>LVD2RLIE</name>
              <description>Low-voltage detection 2 release voltage setting enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVH2RLI" -->
            <field>
              <name>SVH2RLI</name>
              <description>Low-voltage detection 2 release voltage setting bits</description>
              <msb>6</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
